Revit 2027 API
ParameterTypeId.SpliceTypeAtEnd Property
 "Splice at End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpliceTypeAtEnd { get; }
Public Shared ReadOnly Property SpliceTypeAtEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpliceTypeAtEnd {
	ForgeTypeId^ get ();
}
static member SpliceTypeAtEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace